export default [
  {
    label: '特性（強化・バフ・フォトン追加など）',
    children: [
      {
        label: '毎ターン覚醒増加',
        regex: /毎ターン終了時、.+の確率で装備者の覚醒ゲージが.+/
      },
      { label: '毎ターン点穴増加', regex: /毎ターン終了時、装備者の点穴を.+/ },
      { label: '回復量アップ' },
      {
        label: 'フォトン追加（スキル）',
        regex: /装備者が行動開始時、.+の確率でスキルを追加する/
      },
      {
        label: 'フォトン追加（アタック）',
        regex: /装備者が行動開始時、.+の確率でアタックを追加する/
      },
      {
        label: 'フォトン追加（チャージ）',
        regex: /装備者が行動開始時、.+の確率でチャージを追加する/
      },
      {
        label: '攻撃力アップ（HP最大時）',
        regex: /装備者のHPが100%のとき、攻撃力が.+上昇する/
      },
      {
        label: 'HPアップ',
        regex: /装備者のHPが.+上昇する/
      }
    ]
  },
  {
    label: '特性（防御系効果）',
    children: [
      {
        label: '一度のみ蘇生',
        regex: /戦闘不能時、一度だけ最大HPの.+で蘇生する/
      },
      { label: '確率で無効', regex: /装備者が.+の確率でダメージを無効にする/ },
      { label: 'ダメージ軽減', regex: /装備者が受けるダメージを.+軽減する/ },
      {
        label: 'HP最大時ダメージ軽減',
        regex: /装備者のHPが100%のとき、受けるダメージを.+軽減する/
      },
      {
        label: '根性・くいしばり',
        regex: /装備者が致死ダメージを受けたとき、.+の確率で踏みとどまる/
      }
    ]
  },
  {
    label: '特性（攻撃系効果）',
    children: [
      { label: '防御無視', regex: /装備者が攻撃時、防御力を.+無視する/ },
      { label: '反撃', regex: /装備者が攻撃を受けたとき、.+の確率で反撃する/ },
      {
        label: '特殊効果つきの反撃',
        regex: /装備者が攻撃を受けたとき、.+の確率で反撃し、.+/
      }
    ]
  },
  {
    label: '特性（状態異常付与）',
    children: [
      { label: '反撃' },
      { label: '特殊効果つきの反撃' },
      { label: '回復量' }
    ]
  },

  {
    label: '特性（特攻）',
    children: [
      { label: '毒耐性' },
      { label: 'めまい耐性' },
      { label: '感電耐性' },
      { label: '呪い耐性' },
      { label: '暗闇耐性' },
      { label: '睡眠耐性' },
      { label: '凍結耐性' },
      { label: '混乱耐性' },
      { label: '束縛耐性' },
      { label: '病気耐性' },
      { label: 'ノックバック、引き寄せ耐性' },
      { label: '煉獄の炎耐性' },
      { label: 'ねずみ化耐性' },
      { label: 'ゾンビ耐性' },
      { label: '悪夢耐性' },
      { label: '即死耐性' }
    ]
  },
  {
    label: '特性（状態異常耐性）',
    children: [
      { label: '全ての状態異常耐性' },
      { label: 'ステータス弱体耐性' },
      { label: '毒耐性' },
      { label: 'めまい耐性' },
      { label: '感電耐性' },
      { label: '呪い耐性' },
      { label: '暗闇耐性' },
      { label: '睡眠耐性' },
      { label: '凍結耐性' },
      { label: '混乱耐性' },
      { label: '束縛耐性' },
      { label: '病気耐性' },
      { label: 'ノックバック、引き寄せ耐性' },
      { label: '煉獄の炎耐性' },
      { label: 'ねずみ化耐性' },
      { label: 'ゾンビ耐性' },
      { label: '悪夢耐性' },
      { label: '即死耐性' },
      { label: 'フォトン容量低下耐性' },
      { label: 'フォトン破壊耐性' },
      { label: 'フォトン奪取耐性' },
      { label: '覚醒減少耐性' }
    ]
  },
  {
    label: '技（ステータス強化）',
    children: [{ label: '攻撃力' }]
  },
  {
    label: '技（フォトン追加）',
    children: [{ label: '攻撃力' }]
  },
  {
    label: '技（状態異常付与）',
    children: [{ label: '攻撃力' }]
  },
  {
    label: '技（地形効果）',
    children: [{ label: '攻撃力' }]
  },
  {
    label: '技（回復・自動回復・異常回復・蘇生）',
    children: [{ label: '攻撃力' }]
  }
];
